app/controllers/tweets_controller.rb

  def post
    @tweet = Tweet.new(params[:tweet])
    @tweet.posted = Time.now
	@tweet.user = @user
    if @tweet.save
---
INSERT INTO "tweets" ("updated_at", "content", "posted", "created_at") VALUES('2010-06-22 08:48:59', 'Nothing much just relaxing', '2010-06-22 08:48:59', '2010-06-22 08:48:59')

  def user
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)