app/controllers/user_controller.rb

INSERT INTO "users" ("real_name", "updated_at", "username", "password", "created_at") VALUES('Korey Scott', '2010-06-22 08:58:48', 'scottkor', 'ukyo18', '2010-06-22 08:58:48')
---
  def create
    @user = User.new(params[:user])
    if (@user.save)

SELECT * FROM "users" WHERE ("users"."username" = 'scottkor') LIMIT 1
---
  def do_login
    username_from_form = params[:username]
    password_from_form = params[:password]
    @user = User.find_by_username(username_from_form)